In [13]:
#import os    
#os.environ['SPARK_HOME'] = 'D:\\Pyspark\\spark-3.1.1-bin-hadoop3.2'

In [1]:
import findspark
findspark.find()

'D:\\Pyspark\\spark-3.1.1-bin-hadoop3.2'

In [2]:
findspark.init()

In [3]:
import pyspark

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('practise').getOrCreate()

In [5]:
spark

In [19]:
df = spark.read.option('header', True).csv('updated_demographic.csv', inferSchema=True)

In [20]:
df.show()

+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|participant_id|examination_status|gender|age_in_years|race_and_origin|race_and_origin_with_asian|six_months_gap|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|         73557|                 2|     1|          69|              4|                         4|             1|
|         73558|                 2|     1|          54|              3|                         3|             1|
|         73559|                 2|     1|          72|              3|                         3|             2|
|         73560|                 2|     1|           9|              3|                         3|             1|
|         73561|                 2|     2|          73|              3|                         3|             1|
|         73562|                 2|     1|          56|              1|                         1|             1|
|         73563|                 2|     1|           5|              3|                         3|             2|
|         73564|                 2|     2|          61|              3|                         3|             2|
|         73565|                 1|     1|          42|              2|                         2|             2|
|         73566|                 2|     2|          56|              3|                         3|             1|
|         73567|                 2|     1|          65|              3|                         3|             2|
|         73568|                 2|     2|          26|              3|                         3|             2|
|         73569|                 1|     2|           5|              5|                         7|             2|
|         73570|                 2|     2|           9|              5|                         7|             1|
|         73571|                 2|     1|          76|              3|                         3|             1|
|         73572|                 2|     2|          15|              4|                         4|             1|
|         73573|                 2|     1|          15|              4|                         4|             1|
|         73574|                 2|     2|          33|              5|                         6|             1|
|         73575|                 2|     1|           1|              4|                         4|             1|
|         73576|                 2|     1|          16|              4|                         4|             2|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
only showing top 20 rows

In [21]:
type(df)

pyspark.sql.dataframe.DataFrame

In [22]:
#check schema
df.printSchema()

root
 |-- participant_id: integer (nullable = true)
 |-- examination_status: integer (nullable = true)
 |-- gender: integer (nullable = true)
 |-- age_in_years: integer (nullable = true)
 |-- race_and_origin: integer (nullable = true)
 |-- race_and_origin_with_asian: integer (nullable = true)
 |-- six_months_gap: integer (nullable = true)

In [23]:
##Another option
df_spark = spark.read.csv('updated_demographic.csv', header=True, inferSchema=True)

In [24]:
df_spark.printSchema()

root
 |-- participant_id: integer (nullable = true)
 |-- examination_status: integer (nullable = true)
 |-- gender: integer (nullable = true)
 |-- age_in_years: integer (nullable = true)
 |-- race_and_origin: integer (nullable = true)
 |-- race_and_origin_with_asian: integer (nullable = true)
 |-- six_months_gap: integer (nullable = true)

In [25]:
df_spark.show()

+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|participant_id|examination_status|gender|age_in_years|race_and_origin|race_and_origin_with_asian|six_months_gap|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|         73557|                 2|     1|          69|              4|                         4|             1|
|         73558|                 2|     1|          54|              3|                         3|             1|
|         73559|                 2|     1|          72|              3|                         3|             2|
|         73560|                 2|     1|           9|              3|                         3|             1|
|         73561|                 2|     2|          73|              3|                         3|             1|
|         73562|                 2|     1|          56|              1|                         1|             1|
|         73563|                 2|     1|           5|              3|                         3|             2|
|         73564|                 2|     2|          61|              3|                         3|             2|
|         73565|                 1|     1|          42|              2|                         2|             2|
|         73566|                 2|     2|          56|              3|                         3|             1|
|         73567|                 2|     1|          65|              3|                         3|             2|
|         73568|                 2|     2|          26|              3|                         3|             2|
|         73569|                 1|     2|           5|              5|                         7|             2|
|         73570|                 2|     2|           9|              5|                         7|             1|
|         73571|                 2|     1|          76|              3|                         3|             1|
|         73572|                 2|     2|          15|              4|                         4|             1|
|         73573|                 2|     1|          15|              4|                         4|             1|
|         73574|                 2|     2|          33|              5|                         6|             1|
|         73575|                 2|     1|           1|              4|                         4|             1|
|         73576|                 2|     1|          16|              4|                         4|             2|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
only showing top 20 rows

In [26]:
df_spark.columns

['participant_id',
 'examination_status',
 'gender',
 'age_in_years',
 'race_and_origin',
 'race_and_origin_with_asian',
 'six_months_gap']

In [32]:
df_spark.head()

Row(participant_id=73557, examination_status=2, gender=1, age_in_years=69, race_and_origin=4, race_and_origin_with_asian=4, six_months_gap=1)

In [30]:
#selecting a column
df_spark.select('participant_id').show(10)

+--------------+
|participant_id|
+--------------+
|         73557|
|         73558|
|         73559|
|         73560|
|         73561|
|         73562|
|         73563|
|         73564|
|         73565|
|         73566|
+--------------+
only showing top 10 rows

In [33]:
df_spark.select(['participant_id', 'gender']).show()

+--------------+------+
|participant_id|gender|
+--------------+------+
|         73557|     1|
|         73558|     1|
|         73559|     1|
|         73560|     1|
|         73561|     2|
|         73562|     1|
|         73563|     1|
|         73564|     2|
|         73565|     1|
|         73566|     2|
|         73567|     1|
|         73568|     2|
|         73569|     2|
|         73570|     2|
|         73571|     1|
|         73572|     2|
|         73573|     1|
|         73574|     2|
|         73575|     1|
|         73576|     1|
+--------------+------+
only showing top 20 rows

In [34]:
df_spark.dtypes

[('participant_id', 'int'),
 ('examination_status', 'int'),
 ('gender', 'int'),
 ('age_in_years', 'int'),
 ('race_and_origin', 'int'),
 ('race_and_origin_with_asian', 'int'),
 ('six_months_gap', 'int')]

In [38]:
#To escape unnecessasry formating for large table
%%html
<style>
div.output_area pre {
    white-space: pre;
}
</style>

In [43]:
df_spark.describe().toPandas() #toPandas() gives better visualization than show()

,summary,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap
0,count,10175,10175,10175,10175,10175,10175,10175
1,mean,78644.0,1.9644226044226045,1.5083046683046684,32.274299754299754,3.091891891891892,3.28982800982801,1.525995085995086
2,stddev,2937.4138285233153,0.1852431293855907,0.49995559617340146,24.630410253136994,1.2633047033277733,1.613240660729097,0.49934833686004887
3,min,73557,1,1,1,1,1,1
4,max,83731,2,2,85,5,7,2

In [47]:
#Adding columns
df_spark.withColumn('Age in months', df_spark['age_in_years'] * 12).toPandas() #not inplace

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap,Age in months
0,73557,2,1,69,4,4,1,828
1,73558,2,1,54,3,3,1,648
2,73559,2,1,72,3,3,2,864
3,73560,2,1,9,3,3,1,108
4,73561,2,2,73,3,3,1,876
...,...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2,312
10171,83728,2,2,2,1,1,2,24
10172,83729,2,2,42,4,4,2,504
10173,83730,2,1,7,2,2,1,84
10174,83731,2,1,11,5,6,1,132

In [48]:
# Adding the column inplace
df_spark = df_spark.withColumn("age_in_months", df_spark['age_in_years']*12)

In [49]:
df_spark.toPandas()

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap,age_in_months
0,73557,2,1,69,4,4,1,828
1,73558,2,1,54,3,3,1,648
2,73559,2,1,72,3,3,2,864
3,73560,2,1,9,3,3,1,108
4,73561,2,2,73,3,3,1,876
...,...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2,312
10171,83728,2,2,2,1,1,2,24
10172,83729,2,2,42,4,4,2,504
10173,83730,2,1,7,2,2,1,84
10174,83731,2,1,11,5,6,1,132

In [50]:
#Dropping the columns
df_spark = df_spark.drop('age_in_months')

In [52]:
df_spark.toPandas()

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap
0,73557,2,1,69,4,4,1
1,73558,2,1,54,3,3,1
2,73559,2,1,72,3,3,2
3,73560,2,1,9,3,3,1
4,73561,2,2,73,3,3,1
...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2
10171,83728,2,2,2,1,1,2
10172,83729,2,2,42,4,4,2
10173,83730,2,1,7,2,2,1
10174,83731,2,1,11,5,6,1

In [53]:
#Rename the column

df_spark = df_spark.withColumnRenamed('age_in_years', 'age')

In [54]:
df_spark.toPandas()

,participant_id,examination_status,gender,age,race_and_origin,race_and_origin_with_asian,six_months_gap
0,73557,2,1,69,4,4,1
1,73558,2,1,54,3,3,1
2,73559,2,1,72,3,3,2
3,73560,2,1,9,3,3,1
4,73561,2,2,73,3,3,1
...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2
10171,83728,2,2,2,1,1,2
10172,83729,2,2,42,4,4,2
10173,83730,2,1,7,2,2,1
10174,83731,2,1,11,5,6,1